<h1 style='color:blue;text-align:center'> Most frequent used Methods in Pandas</h1>

for more...</br>
[click to see cheetSeet of pandas](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf) </br>
[click to see cheetSheet of R](https://images.datacamp.com/image/upload/v1654763044/Marketing/Blog/R_Cheat_Sheet.pdf)

In [1]:
import pandas as pd
import numpy as np

In [7]:
data=np.random.randint(0,100,(4,3))
data

array([[52, 44, 99],
       [ 6, 16, 63],
       [24, 90, 77],
       [82,  2, 73]])

In [8]:
idx=['india','japan','australia','newzealand']
cols=['jan','feb','mar']
df=pd.DataFrame(data,index=idx,columns=cols)
df

            jan  feb  mar
india        52   44   99
japan         6   16   63
australia    24   90   77
newzealand   82    2   73

In [10]:
url='https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv'
df  = pd.read_csv(url)

## top n or bottom n records

In [11]:
df.head(3)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3

In [12]:
df.tail(2)

     total_bill   tip     sex smoker   day    time  size
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

## get name of all the cols and how to rename the name of any col/cols

In [16]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [17]:
df.index

RangeIndex(start=0, stop=244, step=1)

In [20]:
df.rename(columns={'sex':'gender','smoker':'isSmoker'},inplace=True)
df.head(3)

   total_bill   tip  gender isSmoker  day    time  size
0       16.99  1.01  Female       No  Sun  Dinner     2
1       10.34  1.66    Male       No  Sun  Dinner     3
2       21.01  3.50    Male       No  Sun  Dinner     3

## Statistical description

In [60]:
df.describe().transpose()

            count       mean       std   min      25%     50%      75%    max
total_bill  244.0  19.785943  8.902412  3.07  13.3475  17.795  24.1275  50.81
tip         244.0   2.998279  1.383638  1.00   2.0000   2.900   3.5625  10.00
size        244.0   2.569672  0.951100  1.00   2.0000   2.000   3.0000   6.00

<h2 style='color:green;text-align:center'> Reshaping Data</h2>

In [28]:
df = pd.DataFrame({'id':[1,2,3,1,2],'name':['A','b','c','d','e'],'salary':[100,300,200,100,50]})
df

   id name  salary
0   1    A     100
1   2    b     300
2   3    c     200
3   1    d     100
4   2    e      50

In [25]:
k=df.groupby('id').groups.keys()

In [26]:
list(k)

[1, 2, 3]

In [33]:
l=[]
for e in list(k):
    tmp=(df.groupby('id').get_group(e))
    newdf = (tmp[tmp['salary']==tmp['salary'].max()])
    l.append(newdf)
pd.concat(l)['salary']

0    100
3    100
1    300
2    200
Name: salary, dtype: int64